Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/FastLED_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: Scaling
it_it: Ridimensionamento

source: Scaling Values
it_it: Valori di Scala

source: Scope
it_it: Ambito di Applicazione

source: Scrolling Text
it_it: Testo Scorrevole

source: Search for "FastLED"
it_it: Cercare "FastLED"

source: Second paragraph.
it_it: Secondo paragrafo.

source: Section Headings
it_it: Intestazioni di Sezione

source: Section headings are created by underlining the section title with a punctuation character, at least as long as the text.
it_it: Le Intestazioni di sezione vengono create sottolineando il titolo della sezione con un carattere di punteggiatura, lungo almeno quanto il testo.

source: See the full set of supported code lexers for more details.
it_it: Per maggiori dettagli, vedere il set completo dei lexer dei codici supportati.

source: See Also
it_it: Vedere Anche

source: See [2D/Matrix Operations](../advanced/matrix.md) for more advanced spatial mapping techniques.
it_it: Vedere [Operazioni Matriciali/2D](../advanced/matrix) per tecniche di mappatura spaziale più avanzate.

source: See [Color Order Issues](#wrong-colors) below
it_it: Vedere [Problemi di Ordine dei Colori](#wrong-colors) di seguito

source: See [LED Types](led-types.md) for complete list and usage examples.
it_it: Consultare [Tipi di LED](led-types) per un elenco completo ed esempi di utilizzo.

source: See [Pin Configurations](pins.md) for platform-specific details.
it_it: Vedere [Configurazioni dei Pin](pins) per dettagli specifici sulla piattaforma.

source: See documentation in build.py header comment for details.
it_it: Per i dettagli, consultare la documentazione nel commento dell'intestazione build.py.

source: See the `reStructuredText <https://www.sphinx-doc.org/en/master/usage/restructuredtext/index.html>`_ documentation for details.
it_it: Consultare la documentazione di `reStructuredText <https://www.sphinx-doc.org/en/master/usage/restructuredtext/index.html>`_ per i dettagli.

source: See the full [Cylon example](../../examples/Cylon) in the FastLED repository for more details.
it_it: Consultare l'[Esempio Cylon](../../examples/Cylon/Cylon.ino) completo nel repository FastLED per maggiori dettagli.

source: Selecting random LED positions safely with random16(NUM_LEDS)
it_it: Selezione sicura di posizioni LED casuali con random16(NUM_LEDS)

source: Separate Calculation from Display
it_it: Separare il Calcolo dal Display

source: Separate clock and data lines
it_it: Linee dati e clock separate

source: Separate clock line (more reliable)
it_it: Linea di clock separata (più affidabile)

source: Serial Monitoring
it_it: Monitoraggio Seriale

source: Serial monitoring and diagnostics
it_it: Monitoraggio e diagnostica seriale

source: Serial.print() statements in hot path (remove after debugging)
it_it: Istruzioni Serial.print() nel percorso attivo (rimuovere dopo il debug)

source: Set multimeter to DC current mode (10A range)
it_it: Impostare il multimetro in modalità corrente continua (intervallo 10 A)

source: Setting Up Multiple Controllers
it_it: Configurazione di più Controller

source: Setup Functions
it_it: Funzioni di Configurazione

source: Setup Phase
it_it: Fase di Configurazione

source: Setup functions for adding LEDs, setting brightness, and power management
it_it: Funzioni di configurazione per l'aggiunta di LED, l'impostazione della luminosità e la gestione dell'alimentazione

source: Shared Ground
it_it: Massa In Comune

source: Showing empathy towards other community members
it_it: Mostrare empatia verso gli altri membri della comunità

source: Signal Issues on Long Runs
it_it: Problemi di Segnale su Lunghe Distanze

source: Signal integrity issues
it_it: Problemi di integrità del segnale

source: Similar to APA102
it_it: Simile ad APA102

source: Similar to WS2812B
it_it: Simile al WS2812B

source: Similar to WS2812B, RGBW available
it_it: Simile a WS2812B, RGBW disponibile

source: Similar to scale8 but preserves more detail in darker values:
it_it: Simile a scale8 ma conserva maggiori dettagli nei valori più scuri:

source: Simple Animations
it_it: Animazioni Semplici

source: Simple Breathing
it_it: Respirazione Semplice

source: Simple Chase (One Direction)
it_it: Inseguimento Semplice (Senso Unico)

source: Simple Delay
it_it: Ritardo Semplice

source: Simple Rate Limiting
it_it: Semplice Limitazione della Frequenza

source: Simple Twinkle
it_it: Scintillìo Semplice

source: Simple animation patterns
it_it: Modelli di animazione semplici

source: Simple animations that demonstrate timing and state management.
it_it: Animazioni semplici che dimostrano la gestione di tempi e stati.

source: Simple brightness control without changing color
it_it: Semplice controllo della luminosità senza cambiare colore

source: Simple solution for medium-length strips
it_it: Soluzione semplice per strisce di media lunghezza

source: Simpler XY function: `return (y * MATRIX_WIDTH) + x`
it_it: Funzione XY più semplice: `return (y * MATRIX_WIDTH) + x`

source: Sine Wave
it_it: Onda Sinusoidale

source: Sine Waves
it_it: Onde Sinusoidali

source: Sine wave that oscillates smoothly:
it_it: Onda sinusoidale che oscilla dolcemente:

source: Single LED failure won't break chain
it_it: Un singolo guasto del LED non interrompe la catena

source: Single LED moving
it_it: Singolo LED in movimento

source: Single Wire LEDs (WS2812B, SK6812, WS2813)
it_it: LED a filo singolo (WS2812B, SK6812, WS2813)

source: Single data wire (no clock)
it_it: Singolo cavo dati (senza clock)

source: Single data wire preferred
it_it: È preferibile un singolo cavo dati

source: Single wire simplicity
it_it: Semplicità del singolo cavo

source: Slightly more expensive than WS2812B
it_it: Leggermente più costoso di WS2812B

source: Slow CPU (16 MHz)
it_it: CPU lenta (16 MHz)

source: Slow: Individual Assignments
it_it: Lento: Assegnazioni Individuali

source: Slower refresh rates
it_it: Frequenze di aggiornamento più lente

source: Small multiplier (2-5): Gentle, long wavelengths
it_it: Moltiplicatore piccolo (2-5): Lunghezze d'onda lunghe e delicate

source: Smaller divisor = faster animation
it_it: Un divisore più piccolo = animazione più veloce

source: Smooth Color Fade
it_it: Dissolvenza Uniforme del Colore

source: Smooth Fade In/Out
it_it: Dissolvenza Fluida in Entrata/Uscita

source: Smooth audio readings to avoid jitter:
it_it: Letture audio fluide per evitare jitter:

source: Smooth pulsing/breathing animations.
it_it: Animazioni fluide di pulsazioni/respirazioni.

source: Smoothly transition between different palettes:
it_it: Transizione fluida tra diverse palette:

source: Smoothly transition between two complete patterns:
it_it: Transizione uniforme tra due pattern completi:

source: Smooths voltage fluctuations
it_it: Attenuare le fluttuazioni di tensione

source: Solid Colors
it_it: Colori Pieni

source: Solid colors are the foundation of LED control.
it_it: I colori pieni sono la base del controllo LED.

source: Solution: Call `FastLED.clear()` or `fill_solid(leds, NUM_LEDS, CRGB::Black)` in `setup()`
it_it: Soluzione: chiamare `FastLED.clear()` o `fill_solid(leds, NUM_LEDS, CRGB::Black)` nel `setup()`

source: Solution: Use larger power supply or reduce LED count/brightness
it_it: Soluzione: Utilizzare un alimentatore più potente o ridurre il numero/la luminosità dei LED

source: Solutions: Resolder connections, ensure shared ground, add capacitor
it_it: Soluzioni: Risaldare i collegamenti, assicurarsi che la messa a terra sia condivisa, aggiungere un condensatore

source: Solutions: See [Hardware Problems - Strip Works Partially](hardware.md#strip-works-partially)
it_it: Soluzioni: Vedere [Problemi Hardware - La striscia funziona parzialmente](hardware)

source: Solve common problems and debug your LED setup.
it_it: Risolvere i problemi più comuni ed eseguire il debug della configurazione LED.

source: Some operations can interfere with LED timing:
it_it: Alcune operazioni possono interferire con la temporizzazione dei LED:

source: Some pins have better drive strength
it_it: Alcuni pin hanno una migliore potenza di pilotaggio

source: Some platforms can update all strips in parallel (ESP32, Teensy)
it_it: Alcune piattaforme possono aggiornare tutte le strisce in parallelo (ESP32, Teensy)

source: Some power supplies can't handle full brightness
it_it: Alcuni alimentatori non riescono a gestire la luminosità massima

source: Some specialized strips use 12V - check your datasheet.
it_it: Alcune strisce specifiche utilizzano 12 V - consultare la scheda tecnica.

source: Source
it_it: Sorgente

source: Sparkle (Instant Flash)
it_it: Sparkle (Flash Istantaneo)

source: Sparse LEDs on
it_it: LED sparsi accesi

source: Spatial Blending
it_it: Blending Spaziale

source: Spatial Coordinates
it_it: Coordinate Spaziali

source: Special Symbols
it_it: Simboli Speciali

source: Specify the language after the directive for appropriate syntax highlighting.
it_it: Specificare il linguaggio dopo la direttiva per un'evidenziazione sintattica appropriata.

source: Speed
it_it: Velocità

source: Speed isn't critical (<400 Hz refresh)
it_it: La velocità non è critica (aggiornamento <400 Hz)

source: Speed-Controlled Chase
it_it: Chase a Velocità Controllata

source: Sphinx References (What Sphinx Adds to Docutils)
it_it: Riferimenti a Sphinx (Cosa aggiunge Sphinx a Docutils)

source: Splitting across multiple controllers
it_it: Suddividere la RAM su più controller

source: Start Conservative
it_it: Iniziare in Modo Conservativo

source: Start creating your first LED animations and effects.
it_it: Iniziare a creare le prime animazioni ed effetti LED.

source: Start here:
it_it: Iniziare qui:

source: Start with **Solid Colors** to understand basic LED control
it_it: Iniziare con **Colori Solidi** per comprendere il controllo di base dei LED

source: Start with LED data structures to understand how colors are stored and manipulated, then learn about color theory to work with different color models efficiently.
it_it: Iniziare con le strutture dati dei LED per comprendere come i colori vengono memorizzati e manipolati, poi apprendere la teoria del colore per lavorare in modo efficiente con diversi modelli di colore.

source: Start with low brightness when testing
it_it: Iniziare con una luminosità bassa durante le prove

source: Static Rainbow
it_it: Arcobaleno Statico

source: Static Variables
it_it: Variabili Statiche

source: Static variables are essential for maintaining state between calls
it_it: Le variabili statiche sono essenziali per mantenere lo stato tra le chiamate

source: Static variables retain their values between function calls:
it_it: Le variabili statiche mantengono i loro valori tra le chiamate di funzione:

source: Static vs Dynamic Variables
it_it: Variabili Statiche e Dinamiche

source: Still timing-sensitive like WS2812B
it_it: Resta sensibile alla temporizzazione come WS2812B

source: Strange colors appearing
it_it: Colori strani che compaiono

source: Stretching the Palette
it_it: Allargamento della Palette

source: Strip Groups
it_it: Gruppi di Strisce

source: Strip not physically damaged
it_it: Striscia non danneggiata fisicamente

source: Subtract colors (be careful of underflow):
it_it: Sottrazione di Colori (attenzione all'underflow):

source: Subtract with saturation (min 0):
it_it: Sottrazione con saturazione (min 0):

source: Subtractive Blending
it_it: Fusione Sottrattiva

source: Supported LED Types
it_it: Tipi di LED Supportati

source: Supported LED chipset list with configuration examples for WS2812B, APA102, SK6812, and others
it_it: Elenco dei chipset LED supportati con esempi di configurazione per WS2812B, APA102, SK6812 e altri

source: Suspect buffer overrun
it_it: Sospetto buffer overrun

source: Synchronized Effects
it_it: Effetti Sincronizzati

source: Table of Contents
it_it: Sommario

source: Technical Specifications
it_it: Specifiche Tecniche

source: Technical specifications including data rates, color depth, voltage requirements, current draw, and timing tolerance for major chipsets
it_it: Specifiche tecniche, tra cui velocità di trasmissione dati, profondità di colore, requisiti di tensione, assorbimento di corrente e tolleranza di temporizzazione per i principali chipset

source: Techniques and code examples for debugging your LED projects:
it_it: Tecniche ed esempi di codice per il debug dei progetti LED:

source: Techniques and code examples for diagnosing and debugging FastLED projects.
it_it: Tecniche ed esempi di codice per la diagnosi e il debug di progetti FastLED.

source: Techniques for blending colors and transitioning smoothly between patterns
it_it: Tecniche per miscelare i colori e creare transizioni fluide tra i pattern

source: Techniques for optimizing calculations (integer math, precalculation, bit shifts)
it_it: Tecniche per ottimizzare i calcoli (matematica intera, precalcolo, bit shift)

source: Techniques for synchronizing effects across multiple strips
it_it: Tecniche per sincronizzare gli effetti su più strisce

source: Teensy: Any pin, excellent parallel output
it_it: Teensy: Qualsiasi pin, ottima uscita parallela

source: Tell FastLED about your hardware:
it_it: Informare FastLED sul proprio hardware:

source: Temperature to Color
it_it: Da Temperatura a colore

source: Temporal Dithering
it_it: Dithering Temporale

source: Terrain generation
it_it: Generazione di terreni

source: Test LED strip with known-good controller
it_it: Testare la striscia LED con un controller funzionante

source: Test Pattern to Verify Setup
it_it: Pattern di Test per Verificare la Configurazione

source: Test components individually:
it_it: Testare i componenti singolarmente:

source: Test frame rates to ensure smooth LED updates
it_it: Testare il frame rate per garantire aggiornamenti LED fluidi

source: Test microcontroller alone (Serial output, simple LED blink)
it_it: Testare solo il microcontrollore (uscita seriale, semplice lampeggìo del LED)

source: Test on your target hardware platform
it_it: Testa sulla propria piattaforma hardware

source: Test patterns to verify setup
it_it: Pattern di test per verificare la configurazione

source: Test power supply alone (voltage, current capacity)
it_it: Testare solo l'alimentatore (tensione, capacità di corrente)

source: Test power supply with a multimeter (should read ~5V)
it_it: Testare l'alimentatore con un multimetro (dovrebbe indicare ~5V)

source: Test the strip independently
it_it: Testare la striscia in modo indipendente

source: Test with 10 LEDs first
it_it: Testare prima con 10 LED

source: Test with Serial.println(audioLevel) to see raw readings
it_it: Eseguire un test con Serial.println(audioLevel) per visualizzare le letture grezze

source: Test with a simple pattern like checkerboard
it_it: Testare con un modello semplice come la scacchiera

source: Test with different data pin
it_it: Testare con un pin dati diverso

source: Test with just 1 LED
it_it: Provare con un solo LED

source: Test with simpler versions of your effect first
it_it: Eseguire prima una prova con versioni più semplici dell'effetto

source: Test your installation with this minimal program:
it_it: Verificare l'installazione con questo programma minimale:

source: Testing Color Order
it_it: Test dell'Ordine dei Colori

source: Testing Hardware
it_it: Test dell'Hardware

source: Text Format
it_it: Formato del Testo

source: The API-page generation logic will add at most 1 link to each API documentation page containing matched symbols.
it_it: La logica di generazione delle pagine API aggiungerà al massimo 1 link a ciascuna pagina di documentazione API contenente simboli corrispondenti.

source: The CRGB Array
it_it: L'Array CRGB

source: The Cylon effect features a LED that bounces back and forth with a fading trail:
it_it: L'effetto Cylon è caratterizzato da un LED che rimbalza avanti e indietro con una scia in dissolvenza:

source: The FastLED beat detection APIs were introduced in October 2025 and are still evolving.
it_it: Le API di rilevamento dei "beat" FastLED sono state introdotte nell'ottobre 2025 e sono ancora in fase di evoluzione.

source: The Main Loop Pattern
it_it: Il Pattern del Loop Principale

source: The `ColorFromPalette()` function retrieves colors from a palette with automatic blending:
it_it: a funzione `ColorFromPalette()` recupera i colori da una palette con "blending" [fusione] automatica:

source: The `blend()` function smoothly interpolates between two colors:
it_it: La funzione `blend()` interpola in modo fluido tra due colori:

source: The below are some rules to follow when updating any of the .rst files located in the ./docs/src/ directory tree.
it_it: Di seguito sono riportate alcune regole da seguire quando si aggiorna uno qualsiasi dei file .rst presenti nella directory ./docs/src/.

source: The breathing effect uses sine wave functions to create smooth oscillations:
it_it: L'effetto respirazione utilizza funzioni sinusoidali per creare oscillazioni fluide:

source: The classic "Cylon eye" or "KITT" effect:
it_it: Il classico effetto "Occhio del ciclone" o effetto "KITT":

source: The classic "Cylon" or "Knight Rider" scanner is an iconic example that teaches essential animation techniques.
it_it: Il classico scanner "Cylon" o "Knight Rider" è un esempio iconico che insegna le tecniche di animazione essenziali.

source: The classic Cylon/Knight Rider scanner is a great introduction to animation loops.
it_it: Il classico scanner Cylon/Knight Rider è un'ottima introduzione ai loop di animazione.

source: The difference between RGB and HSV color models and when to use each
it_it: Differenza tra i modelli di colore RGB e HSV e quando utilizzarli

source: The difference between RGB and HSV color spaces and when to use each
it_it: La differenza tra gli spazi colore RGB e HSV e quando utilizzarli

source: The difference between blocking and non-blocking timing approaches
it_it: La differenza tra approcci di temporizzazione bloccanti e non bloccanti

source: The difference between bouncing (bidirectional) and chase (unidirectional) effects
it_it: La differenza tra effetti di rimbalzo (bidirezionali) e inseguimento (unidirezionali)

source: The difference between global and per-LED brightness control
it_it: La differenza tra il controllo della luminosità globale e quello per singolo LED

source: The difference between serpentine and progressive matrix layouts
it_it: La differenza tra layout a matrice serpentina e progressiva

source: The divisor on `millis()` controls animation speed:
it_it: Il divisore di `millis()` controlla la velocità dell'animazione:

source: The essential setup() and loop() pattern for FastLED programs
it_it: I pattern essenziali setup() e loop() per i programmi FastLED

source: The essential setup() and loop() pattern in action
it_it: I pattern essenziali setup() e loop() in azione

source: The fade in/out effect is one of the most fundamental animations in LED programming.
it_it: L'effetto dissolvenza in entrata/uscita è una delle animazioni più fondamentali nella programmazione LED.

source: The fade in/out effect teaches you how to create smooth transitions using brightness control.
it_it: L'effetto dissolvenza in entrata/uscita insegna come creare transizioni fluide utilizzando il controllo della luminosità.

source: The fire effect uses a heat simulation approach:
it_it: L'effetto fuoco utilizza un approccio di simulazione del calore:

source: The fundamental data structure in FastLED is the `CRGB` array:
it_it: La struttura dati fondamentale in FastLED è l'array `CRGB`:

source: The key to using noise effectively is understanding how the parameters affect the output:
it_it: La chiave per usare il rumore in modo efficace è capire come i parametri influenzano l'output:

source: The links are to the whole API page, not to the symbols.
it_it: I link sono all'intera pagina API, non ai simboli

source: The list of symbols (or prefixes) can be separated by commas or spaces, and they can wrap onto subsequent lines of text so long as they are indented.
it_it: L'elenco dei simboli (o prefissi) può essere separato da virgole o spazi e può essere inserito nelle righe di testo successive, purché siano indentate.

source: The main loop structure
it_it: La struttura del ciclo principale

source: The most basic form of LED control - setting individual pixels:
it_it: La forma più elementare di controllo LED: impostazione dei singoli pixel:

source: The most important function for matrix work is the XY mapper, which converts 2D coordinates to array indices.
it_it: La funzione più importante per le matrici è il mappatore XY, che converte le coordinate 2D in indici di array.

source: The power of static variables for maintaining animation state
it_it: La potenza delle variabili statiche per mantenere lo stato dell'animazione

source: The project team is obligated to maintain confidentiality with regard to the reporter of an incident.
it_it: Il team di progetto è tenuto a mantenere la riservatezza nei confronti di chi segnala un incidente.

source: The purpose is to provide the reader with links to applicable API pages.
it_it: Lo scopo è fornire al lettore i link alle pagine API applicabili.

source: The rainbow appears to move along the strip as the starting hue increments each frame.
it_it: L'arcobaleno sembra muoversi lungo la striscia man mano che la tonalità iniziale aumenta a ogni fotogramma.

source: The recommended order for learning FastLED basics
it_it: L'ordine consigliato per apprendere le basi di FastLED

source: The simplest timing method using `delay()`:
it_it: Il metodo di temporizzazione più semplice che utilizza `delay()`:

source: The spaces surrounding substitutions are required for parsing, but when you need to remove them in the output (as in the example above), do so by escaping them with the \ character.
it_it: Gli spazi che circondano le sostituzioni sono necessari per il parsing, ma quando è necessario rimuoverli nell'output (come nell'esempio precedente), è possibile farlo utilizzando il carattere di escape \.

source: The temperature outside is 20\ |deg|\ C.
it_it: La temperatura esterna è di 20\ |deg|\ C.

source: The twinkle effect creates a starry night appearance by:
it_it: L'effetto luccichìo crea l'effetto di una notte stellata:

source: The use of sexualized language or imagery and unwelcome sexual
it_it: L'uso di linguaggio o immagini a sfondo sessuale e attenzioni o

source: The virtual combined strip concept for treating multiple strips as one
it_it: Il concetto di striscia combinata virtuale per trattare più strisce come una sola

source: Then simply copy the effect function into your code and call it from your `loop()` function.
it_it: Poi, copiare semplicemente la funzione effetto nel codice e richiamarla dalla funzione `loop()`.

source: Then, any of those substitutions can be used in that .rst file.
it_it: Poi, , qualsiasi di queste sostituzioni può essere utilizzata nel file .rst.

source: There must be one empty line between the code block directive and the code.
it_it: Deve esserci una riga vuota tra la direttiva del blocco di codice e il codice.

source: These advanced topics are covered in the [Advanced Effects](../advanced/) section.
it_it: Questi argomenti avanzati sono trattati nella sezione [Effetti Avanzati](../advanced/README).

source: These are the most basic operations you'll use in every project.
it_it: Queste sono le operazioni più basilari che utilizzerai in ogni progetto.

source: These classical techniques form the foundation of all LED programming - from simple strips to complex 2D and 3D installations.
it_it: Queste tecniche classiche costituiscono la base di tutta la programmazione LED, dalle semplici strisce alle complesse installazioni 2D e 3D.
